npm create vite@latest . --template react

npm install


npm run dev

문제
이거 작성하는 이유? 나중에 찾기 귀찮음. 그렇다고 지금 수정하기도 귀찮음
1. 방 생성에서 생성하기 버튼 연타시 방이 여러개 생김


추가해야 할 목록
1. 1인 테트리스
2. 멀티 테트리스



음... 일단 1인 테트리스도 기본적으로는 작동이 돼. 이제 제일 중요한 멀티 테트리스 부분을 구현해야 하거든? 
이건 and-tetris 파일에서 테트리스 관련 파일을 보면 돼. 거기는 망하긴해도 멀티 테트리스를 완성했던 코드거든
일단 구현해야 할 부분을 알려주자면 and-tetris 부분이랑 거이 똑같이 하면 돼. 
2명부터 시작할 수 있고, 게임 시작시 왼쪽에 본인 필드, 오른쪽에는 상대방 필드들, 아웃되면 필드 안보이게, 게임 끝나면 방 목록 혹은 방(대기실)로 등등 거이 똑같이 해주면 돼. 


좋아 이제까지 있던 그리고 지금 있는 문제들을 하나씩 알려줄게
1. 방 생성에서 생성하기 버튼 연타시 방이 여러개 생김
2. 멀티 게임을 보면 현재 화면이 뭔가 이상해. 뭔가 어딘가 문제가 있는거 같음
3. 1인 테트리스에 들어가면 이렇게 보이는데 지금 ui 디자인이 이상하게 보며 물론 디자인을 아직 안했으니까
4. 조작키 설정에서 변경 할 때 스페이스 바를 누르면 공백처럼 표시돼.

일단 지금 1인 테트리스는 내가 4번째?에 이미지를 올려줬는데 그거랑 비슷하게, 없는 기능은 신경쓰지 말고 비슷하게 디자인 해줘. 아마 Solar-System-Tetris 쪽에서 미니 테트리스? 디자인 참고하면 될거야.
그리고 멀티 테트리스는 5번째?에 이미지를 올렸는데 그거랑 비슷하게 해주면 돼. 이건 and-tetris 쪽 코드를 보면 참고 할 수 있을거야.
참고로 배경은 이미지라 나중에 넣을 예정이야

  

정리하자면 너한테 좋게, 기본적으로 연결해야 하는 복잡한 기능들은 다 구현했고, 나머지 문제나 기능은 gpt,클로드 도움 받기 쉬울거임
음 일단 문제가 좀 많으니 생각한 문제들은 정리 해 놔.

1. 방 배열 문제
2. 디자인 문제

방 관련 디자인, 멀티 테트리스, 1인 테트리스, 전체적인 비율 조정 정도?



디자인 순서 
1. 로그인 -진행 중- -완성-
2. 로비 - 진행 중- -완성-
3. 조작키 설정 - 진행 중- -완성-
4. 방 목록 - 진행 중- -완료-
5. 방 생성 - 진행중- 완료-
6. 방
7. 1인 게임
8. 멀티 게임